# ViewOnASheetCannotBeUncropped3DPerspectiveView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewSheetFailures..::..ViewOnASheetCannotBeUncropped3DPerspectiveView Property
BuiltInFailures..::..ViewSheetFailures Class See Also
---
Sheets do not support uncropped perspective views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ViewOnASheetCannotBeUncropped3DPerspectiveView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewOnASheetCannotBeUncropped3DPerspectiveView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ViewOnASheetCannotBeUncropped3DPerspectiveView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewSheetFailures Class
Autodesk.Revit.DB Namespace